Revit 2026 API

# DesignToFabricationConverter Properties

---

The DesignToFabricationConverter type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

#### Reference

DesignToFabricationConverter Class

Autodesk.Revit.DB.Fabrication Namespace